//
//  InitSqlite3.m
//  store
//
//  Created by yangjun on 16/1/9.
//  Copyright © 2016年 yangjun. All rights reserved.
//

#import <Foundation/Foundation.h>
#import <Foundation/NSArray.h>
#import "InitSqlite3.h"
#import "KCDbManager.h"
#import "CurrentLevel.h"
#import "Item.h"

#define sqlFileName @"plan.sqlite3"

@implementation InitSqlite3
- (void) createDataBase{
    NSString *key=@"IsCreatedDb";
    NSUserDefaults *defaults=[[NSUserDefaults alloc]init];
    
    [defaults setValue:@0 forKey:key]; //数据库不变了就删了这个条目
    
    if ([[defaults valueForKey:key] intValue]!=1) {
        //NSlog(@"we create the world!!!");
        [self createPlanItemTable];
        [self createPlanHistoryTable];
        [self createJokeItemTable];
        [self createPictureItemTable];
        [self createLevelItemTable];
        [self insertPlanItem];
        [self insertJokeItem];
        [self insertPictureItem];
        [defaults setValue:@1 forKey:key];
    }
    [self outputTable];
}
- (void) insertPlanItem{
    //NSString* content1 = @"hello";
    //NSString* content2 = @"content1";
    //NSString* content3 = @"content2";
    //NSString* info = @"info";
    NSString* pref = @"1";
    NSString* effe = @"1";
    //NSString* diff = @"diff";

    //NSNumber* inte = [[NSNumber alloc] initWithInt:1];
    //NSNumber* chan = [[NSNumber alloc] initWithInt:1];
    //NSNumber* sour = [[NSNumber alloc] initWithInt:1];
    NSNumber* numb = [[NSNumber alloc] initWithInt:0];
    //NSNumber* clus = [[NSNumber alloc] initWithInt:1];
    
    
    NSArray * content1 = [[NSArray alloc] initWithObjects:
      @"写下一件值得感恩的事。感恩是一个奇迹，是一种欣赏，它可以让你在逆境中看到光明，可以让你在富裕中保持清醒。",
      @"想一想某个值得感恩的人，并向TA表达你的感恩之情。心理学研究表明，感恩能让人增加对生活的热爱，能更积极地创造价值。",
      @"从积极、值得感恩的角度去思考一件让你不开心的事。《失乐园》中写道，“心是自己的殿堂，它能把地狱变成天堂，也能把天堂变成地狱。”感恩能让我们用心去体会这个世界的奇妙和美好",
      @"与好友分享一件值得感恩的事情。分享不但是增强友谊的好途径，还能传递自己的正能量。",
      @"向父母表达感恩之情，用自己的方式感谢他们的陪伴与温暖。父母是自己最好的老师，还没向ta们表达感恩之情？快快行动吧～",
      @"问候一个很久没有联系的好友。友谊之树需要我们常常浇灌～",
      @"记录一件来自陌生人的暖心小事。陌生人的善意与理解能让我们温暖很久，当然也需要我们的传递和行动啦～",
      @"记录一件与家人相处的充满爱的小事",   /* class 1 */
      @"想象并写下未来期待中的美好生活。",
      @"写下当前困扰你的事",
      //10
      @"写下今天遇到的三件开心的事",
      @"关注下上学路上看到的美好景色，并用优美的文字描述～",
      @"深呼吸，让自己从焦虑中平静下来",
      @"记录下自己最近的3个小进步。总结自己最近的努力和收获，为自己加油鼓劲～",
      @"写下一个最近想要实现的但还没达成的目标",
      @"记录一件你曾经历过的好事、喜事",   /* class 2 */
      @"在心里对自己大喊“停！别想了！”来阻止自己纠结的没完没了",
      @"动起来，选一件自己喜欢的事做起来，把自己从思虑过度中拯救出来",
      @"平静下来，抽出30分钟来思考",
      @"找好朋友倾诉自己最近的困惑与担忧或者分享自己的快乐",
      //20
      @"将困扰你的事写下来",
      @"唱一首自己喜欢的歌曲，感受音乐带来的激情和释放",
      @"看一则笑话段子开心一下",        /* class 3 */
      @"试着做三件好事并记录下来",
      @"看一些轻松的图片",
      @"给家人打个问候电话",
      @"给朋友发张电子贺卡",
      @"给最近要过生日的朋友准备一份礼物",
      @"参加一个志愿者活动",
      @"对他人报以微笑",
      //30
      @"记得笑着对服务员说“你好”“谢谢”",   /* class 4 */
      @"试着与父母多一些交流",
      @"和朋友一起散步聊天",
      @"和朋友一起出去吃顿大餐",
      @"和朋友一起去看场电影",
      @"和妈妈一起做顿饭",
      @"和父母一起逛超市采购",
      @"和妈妈一起去买菜",
      @"和朋友一起逛街",
      @"和朋友相约运动一下",
      //40
      @"为家人做一件事",
      @"帮助你的好朋友实现一个小梦想",
      @"与父母或朋友分享你的内心体验",
      @"拥抱父母",
      @"试着拥抱你的好朋友",
      @"和朋友一起玩桌游",          /* class 5 */
      @"集中精力处理和问题有关的事务",
      @"闭眼半分钟，不要想任何事。然后选择一件最重要的事入手完成",
      @"写出这一周的主要工作,并列成条目",
      @"理清必须做的事，制定并记录下相关计划，一步步去完成",
      //50
      @"试着向他人请教以寻求帮助",
      @"写下自己的痛苦，以及感悟",
      @"做一套“ABCDE”思想辩论训练\r\n（A） 自己对此事件的想法\r\n（B）这想法所引发的情绪\r\n（C）对原想法的不合理成分进行驳斥\r\n（D） 建立理性的想法和适当的情绪\r\n（E）建立理性的新想法", /* class 6 */
      @"试着谅解那些伤害过你的人",
      @"回忆一下自己给父母带来的伤害，感谢他们原谅了你",
      @"对于给你带来伤害的人，多想想TA好的一面",
      @"不要再回想过去的伤痛",
      @"回忆给你带来伤害的人，试这写下谅解的话",/* class 7 */
      @"选择一种擅长的运动，和朋友一起玩high",
      @"集中精力解决工作或学习中的一个问题，完成后给自己放松",
      //60
      @"给朋友推荐一部喜欢的电影/电视剧，说说自己对它的独到见解", /* class 8 */
      @"回忆并写下过去的一件幸福小事",
      @"抽出几分钟投入地做一件事（吃饭、洗澡、等车等），并仔细体会",
      @"细细体会今天两件快乐的事",
      @"出去晒晒太阳，呼吸一下新鲜空气，感受生活中平凡的小幸福",
      @"找个朋友一起回忆和TA曾经的一件开心小事",
      @"和朋友一起对于一项共同回忆故地重游，重温幸福美好",
      @"和家人一起翻看过去的照片",
      @"和家人一起回忆过去的幸福时光",
      @"去猫咖啡馆和喵星人亲密接触",
      //70
      @"整理一下自己收到的所有礼物，回味幸福",
      @"去户外走走，欣赏大自然",
      @"抽出几分钟欣赏阳光、落日、晚霞或星空",
      @"认真观察感受周围的一切，记录三件身边的快乐、美好与神奇",
      @"做一点简单的伸展运动，集中注意力，在伸展的过程中感受身体细微的变化",
      @"试着沉醉于你进行的任何一项活动中，比如安心享用食物而不思考其他任何",
      @"给自己准备一本随身幸福小相册，心情不好的时候拿出来看一看",
      @"用镜头记录美好的瞬间",
      @"计划一次短途旅行",
      @"听听经典怀旧老歌",
      //80
      @"闭上眼慢慢地欣赏一段轻音乐",
      @"和家人朋友来一个烛光晚餐",
      @"试着买一盆绿植点缀卧室",
      @"试着养一个宠物，推荐植物、乌龟、金鱼",
      @"去拍一套写真，感受一下不同风格的自己",
      @"抽出5分钟，对着镜子微笑",
      @"和朋友一起烧烤、野餐",
      @"试着学习做一道菜，可以加点自己的小创意哦",
      @"沏壶茶，给自己一个小时细细品读美文",    /* class  9*/
      @"给自己定下一个容易实现的小目标，完成后给自己一些小奖励",
      //90
      @"给自己制定一套近期内的一系列小目标，每完成一个就做记录并给自己小奖励", /* class  10 */
      @"抽出10分钟进行冥想训练",
      @"去操场慢跑30分钟",
      @"上一节瑜伽课或者学习瑜伽教学视频",
      @"试试跳绳",
      @"去健身房运动一下",
      @"上一节舞蹈课",
      @"和朋友相约去打球",
      @"抽出5分钟，跟着视频做一节呼吸操",
      @"阳光明媚的日子和一众朋友去骑行",
      @"游一场泳",   /* class 11 */
      //100
                                                          nil];
    NSArray * info = [[NSArray alloc] initWithObjects:@"写下一件值得感恩的事",
                                                      @"向他人表达你的感恩之情",
                                                      @"从积极的角度去思考",
                                                      @"与好友分享一件值得感恩的事情",
                                                      @"向父母表达感恩之情",
                                                      @"问候好友",
                                                      @"记录暖心小事",
                                                      @"记录充满爱的小事",   /* class 1 */
                                                      @"想象并写下期待的生活",
                                                      @"积极面对困扰",
                                                      //10
                                                      @"写下今天三件开心的事",
                                                      @"记录美好景色",
                                                      @"深呼吸",
                                                      @"记录下小进步",
                                                      @"写下你的计划",
                                                      @"记录一件好事",   /* class 2 */
                                                      @"停止纠结",
                                                      @"做自己喜欢的事",
                                                      @"静心来思考",
                                                      @"找朋友倾诉",
                                                      //20
                                                      @"丢掉困扰的包袱",
                                                      @"用歌声释放自己",
                                                      @"来看一则笑话吧",
                                                      @"做三件好事",       /* class 3 */
                                                      @"看轻松的图片",
                                                      @"电话问候家人",
                                                      @"给朋友发电子贺卡",
                                                      @"给要过生日的朋友准备礼物",
                                                      @"参加志愿活动",
                                                      @"对他人报以微笑",
                                                      //30
                                                      @"与服务员互动",   /* class 4 */
                                                      @"与父母交流想法",
                                                      @"和朋友散步聊天",
                                                      @"和朋友吃顿大餐",
                                                      @"和朋友看场电影",
                                                      @"和妈妈做饭",
                                                      @"和父母逛超市",
                                                      @"和妈妈去买菜",
                                                      @"和朋友逛街",
                                                      @"和朋友相约运动",
                                                      //40
                                                      @"为家人做一件事",
                                                      @"给好朋友帮助",
                                                      @"与父母或朋友分享",
                                                      @"拥抱父母",
                                                      @"试着拥抱好朋友",
                                                      @"和朋友玩桌游",          /* class 5 */
                                                      @"集中精力做事",
                                                      @"闭眼",
                                                      @"给工作排优先级",
                                                      @"理清当前的工作",
                                                      //50
                                                      @"向他人请教",
                                                      @"写下痛苦和感悟",
                                                      @"做一套训练题", /* class 6 */
                                                      @"谅解别人",
                                                      @"回忆一件谅解的事",
                                                      @"试着谅解他人",
                                                      @"不要回想伤痛的事",
                                                      @"尝试谅解他人",   /* class 7 */
                                                      @"去玩擅长的运动",
                                                      @"集中精力工作",
                                                      //60
                                                      @"向朋友推荐", /* class 8 */
                                                      @"回忆一件幸福小事",
                                                      @"投入地做一件事",
                                                      @"回味快乐的事",
                                                      @"去户外晒晒太阳",
                                                      @"回忆开心小事",
                                                      @"故地重游",
                                                      @"翻看过去的照片",
                                                      @"回忆幸福时光",
                                                      @"尝试新鲜的事",
                                                      //70
                                                      @"整理收到过的礼物",
                                                      @"去户外走走",
                                                      @"欣赏自然美景",
                                                      @"记录生活",
                                                      @"做简单的伸展运动",
                                                      @"试着沉醉于当前活动",
                                                      @"给做一个幸福小相册",
                                                      @"用镜头记录美好的瞬间",
                                                      @"计划一次短途旅行",
                                                      @"听听经典怀旧老歌",
                                                      //80
                                                      @"闭上眼欣赏一段轻音乐",
                                                      @"和家人朋友来一个烛光晚餐",
                                                      @"试着买一盆绿植",
                                                      @"试着养一个宠物",
                                                      @"去拍一拍写真",
                                                      @"对着镜子微笑",
                                                      @"和朋友一起烧烤、野餐",
                                                      @"试着学习做一道菜",
                                                      @"品读美文",    /* class 9 */
                                                      @"完成一个小目标",
                                                      //90
                                                      @"制定一系列小目标",/* class 10 */
                                                      @"冥想",
                                                      @"慢跑",
                                                      @"上一节瑜伽课",
                                                      @"试试跳绳",
                                                      @"去健身房运动一下",
                                                      @"上一节舞蹈课",
                                                      @"和朋友相约去打球",
                                                      @"做一节呼吸操",
                                                      @"和朋友去骑行",
                                                      @"游一场泳",   /* class 11 */
                                                    //100
                      
                                                      nil];
    NSArray * content2 = [[NSArray alloc] initWithObjects:
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"试着用积极的态度去分析它的前因后果",
      @"",@"",@"",@"",@"为这个目标定出你的计划",@"",@"",@"",@"",@"",
      @"不要有思想负担，甩开包袱，轻装前进",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"排好它们的优先级，按优先级去完成",@"",
                          
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
                                                          nil];
    NSArray * content3 = [[NSArray alloc] initWithObjects:
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
      @"",@"",@"",@"",@"",@"",@"",@"",@"",@"",
                                                          nil];

    NSArray * inte = [[NSArray alloc] initWithObjects:
      @"2",@"1",@"1",@"1",@"1",@"1",@"2",@"2",@"2",@"3",
      @"4",@"2",@"1",@"4",@"1",@"2",@"1",@"1",@"1",@"1",
      @"2",@"1",@"6",@"4",@"7",@"1",@"1",@"1",@"1",@"1",
      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"5",@"1",
      
      @"1",@"2",@"1",@"1",@"1",@"1",@"1",@"2",@"1",@"1",
      @"1",@"2",@"1",@"4",@"1",@"1",@"1",@"1",@"1",@"1",
      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      nil];
    NSArray * diff = [[NSArray alloc] initWithObjects:
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",

      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
      @"0.1",@"0.2",@"0.3",@"0.4",@"0.5",@"0.6",@"0.7",@"0.8",@"0.9",@"1.0",
                                                     nil];
    NSArray * chan = [[NSArray alloc] initWithObjects:@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                      
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      nil];
    NSArray * sour = [[NSArray alloc] initWithObjects:@"0",@"0",@"0",@"0",@"0",@"0",@"0",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"2",@"2",@"2",@"2",@"2",
                                                      @"3",@"3",@"3",@"3",@"3",@"3",@"3",@"3",@"3",@"3",
                                                      @"4",@"4",@"4",@"4",@"4",@"4",@"4",@"4",@"4",@"4",
                                                      @"4",@"4",@"4",@"5",@"5",@"5",@"5",@"5",@"5",@"5",
                                                      
                                                      @"5",@"5",@"6",@"6",@"6",@"6",@"6",@"7",@"7",@"7",
                                                      @"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",
                                                      @"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",
                                                      @"8",@"8",@"8",@"8",@"8",@"8",@"8",@"8",@"9",@"9",
                                                      @"9",@"9",@"9",@"9",@"9",@"9",@"9",@"9",@"9",@"9",
                                                      nil];
    NSArray * clus = [[NSArray alloc] initWithObjects:@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"10",@"1",@"11",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",@"1",
                                                      @"1",@"1",@"1",@"1",@"1",@"2",@"2",@"2",@"1",@"1",
                                                      @"1",@"2",@"2",@"2",@"2",@"2",@"2",@"2",@"2",@"2",
                                                      nil];
    KCDbManager *manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    int loop;
    for(loop = 0; loop < SUM_OF_ITEM; loop ++){
        //给笑话和图片加上比较大的权重
        if (loop == 22 || loop == 24) {
            effe = @"30";
        }else{
            effe = @"1";
        }
        NSArray* array = [[NSArray alloc] initWithObjects:content1[loop], content2[loop], content3[loop], info[loop], pref, effe, diff[loop], inte[loop], chan[loop], sour[loop], numb, clus[loop], nil];
        NSString * sql = [NSString stringWithFormat:@"INSERT INTO PlanList (\
                          content1 ,content2 , content3 ,info ,pref , effe ,\
                          diff , inte , chan , sour , numb , clus) VALUES \
                          ('%@','%@','%@','%@','%@','%@','%@','%@','%@','%@','%@','%@')",array[0],array[1],array[2],array[3],array[4],array[5],array[6],array[7],array[8],array[9],array[10],array[11]];
        [manager executeNonQuery:sql];
    }
    [manager close];
}
- (void) outputTable{
    NSString *sql= @"SELECT * FROM PlanList ORDER BY ID";
    KCDbManager* manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    NSArray * all = [manager executeQuery:sql];
    for(int i=0;i<all.count;i++){
        //NSlog(@"output item %i ",i);
        Item *item = [Item new];
        item.content1 = [all[i] objectForKey:@"content1"];
        item.content2 = [all[i] objectForKey:@"content2"];
        item.content3 = [all[i] objectForKey:@"content3"];
        item.info = [all[i] objectForKey:@"info"];
        item.pref = [all[i] objectForKey:@"pref"];
        item.effe = [all[i] objectForKey:@"effe"];
        item.diff = [all[i] objectForKey:@"diff"];
        item.inte = [all[i] objectForKey:@"inte"];
        item.chan = [all[i] objectForKey:@"chan"];
        item.sour = [all[i] objectForKey:@"sour"];
        item.numb = [all[i] objectForKey:@"numb"];
        item.clus = [all[i] objectForKey:@"clus"];
        //NSlog(@"succeed output a value:");
        //NSlog(@"%@ %@ %@ %@ %@ %@ %@ %@ %@ %@ %@ %@",item.content1,item.content2,item.content3,item.info, item.pref, item.effe, item.diff, item.inte, item.chan, item.sour, item.numb, item.clus);
    }
    [manager close];
}
- (void) createPlanItemTable{
    NSString *drop_if_exists = @"DROP TABLE IF EXISTS PlanList;";
    NSString *sql=      @"CREATE TABLE PlanList (id integer PRIMARY KEY AUTOINCREMENT,\
         content1 text,content2 text, content3 text,info text,pref text, effe text,\
    diff text, inte integer, chan integer, sour integer, numb integer, clus integer\
    )";
    
    KCDbManager* manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    [manager executeNonQuery:drop_if_exists];
    [manager executeNonQuery:sql];
    [manager close];
}
- (void) createPlanHistoryTable{
    NSString *sql=@"CREATE TABLE History (id integer PRIMARY KEY AUTOINCREMENT,\
    done integer,have integer,number integer, sickNumber integer, id1 integer, id2 integer,id3 integer,\
    id4 integer, type1 integer, type2 integer, type3 integer, type4 integer,time0 text, time1 text,time2 \
    text,time3 text,time4 text,fintime1 text, fintime2 text, fintime3 text, fintime4 text, fin1 integer,\
    fin2 integer,fin3 integer, fin4 integer, output1 text, output2 text, output3 text, output4 text, \
    stress0 text, stress1 text, stress2 text,stress3 text, stress4 text, stress5 text,effect text,flowerState text)";
    KCDbManager* manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    [manager executeNonQuery:sql];
    [manager close];
}
- (void) createJokeItemTable{
    NSString *drop_if_exists = @"DROP TABLE IF EXISTS JokeList;";
    NSString *sql=      @"CREATE TABLE JokeList (id integer PRIMARY KEY AUTOINCREMENT,sentence text)";
    KCDbManager* manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    [manager executeNonQuery:drop_if_exists];
    [manager executeNonQuery:sql];
    [manager close];
}
- (void) createPictureItemTable{
    NSString *drop_if_exists = @"DROP TABLE IF EXISTS PictureList;";
    NSString *sql=      @"CREATE TABLE PictureList (id integer PRIMARY KEY AUTOINCREMENT,\
    sentence text,pictureName text, type text)";
    KCDbManager* manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    [manager executeNonQuery:drop_if_exists];
    [manager executeNonQuery:sql];
    [manager close];
}
- (void) createLevelItemTable{
    NSString *sql=      @"CREATE TABLE LevelList (id integer PRIMARY KEY AUTOINCREMENT,\
    level text,type integer, time text)";//如果用浮点数表示时间的话就用integer
    KCDbManager* manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    [manager executeNonQuery:sql];
    [manager close];
}

- (void) insertJokeItem{
    NSString *joke[SUM_OF_JOKE]={
        @"上小学三年级时我总欺负同桌，直到有天她老爸来给她送伞，看她老爸光头纹身，一脸的横肉！\r\n我问她：“你老爸干嘛的？”\r\n她说贩毒的！\r\n从那以后再也不敢欺负她了！直到有一天，我看到她爸在街上卖老鼠药。。。",
        @"我学的美术，我问朋友能否画一张他的画象作为课堂作业。\r\n他同意了，我画好后交上，只得了个C。\r\n我问为什么给这么低的分，教授说我的画比例不对：“头太大，肩太宽，胳膊太细。”\r\n第二天，我带朋友去见教授。\r\n教授瞧了朋友一眼，说：“好吧，A。”",
        @"上课的时候我正津津有味的玩手机，突然坐在窗子边的同学喊：注意了，校长来了。\r\n我连忙把手机藏好然后清了清嗓子说：同学们，今天我们讲第三章。",
        @"这次的四级考试还不错，发货挺快的坐下就收到卷子了，试卷印刷很清晰，题型都全了，监考老师服务态度挺好给一个赞，唯一不好的就是都是回头客还不给优惠。总体五星好评，下次还会再来的。",
        @"中学时的数学李老师特别能拖堂，有天漂亮的语文老师很奇怪的问：为什么你们总是管你们李老师叫托塔李天王呢？！\r\n同学说：老师，你听错了，是拖堂李天王。\r\n语文老师:噗。。。",
        @"儿子中考考试考差了，被老婆骂了一顿。\r\n我去安慰儿子：“你要努力学习，以后一定要超越爸爸。”\r\n儿子愣了一下，弱弱来了一句：“别的我不敢保证。但是，以后找个比你好的老婆还是很有把握的。”",
        @"三岁的儿子从幼儿园回来气呼呼的对我说：“爸爸，老师一点都不好，总是凶我，中午还不拍拍我睡觉。”\r\n我：“老师不可能像妈妈一样照顾那么多人的，你要听话。”\r\n儿子：“让老师和妈妈换换就好了，妈妈每天在幼儿园陪我，老师在家陪爸爸睡觉。”\r\n想想竟然有点激动呢。",
        @"甲：“手机斗地主一直输，是什么原因让你坚持下去的？”\r\n乙：“因为队友一直鼓励我。”\r\n甲：“怎么鼓励的？”\r\n乙：“你的牌打的也忒好了！”\r\n甲：“……”",
        @"张三从小就感觉自己不是亲生的。\r\n一次他在外面玩，不小心掉粪坑里了，她妈看到了说：“这孩子我们不要了吧！回去再生一个吧。”\r\n后来长大点，一次发高烧了，她妈用手摸了下他的额头，立刻把手缩回去了说：“好烫啊！”\r\n他爸立马一个大嘴巴子抽了过去说：“看把你妈烫的！”\r\n这是亲的吗？",
        @"有个文学批评家。在参加一次宴会时，因不愿听庸俗音乐，不断地用手捂耳朵。\r\n主人问道：“您不爱听？演奏的乐曲可都是最流行的、高尚的。”\r\n批评家说：“流行的就是高尚的吗？”\r\n主人反问：“不高尚会流行吗？”\r\n批评家说：“感冒流行，高尚吗？”",
        //10
        @"某天，雅惠与好友相聚，感叹自己都二十八岁还没有男朋友。好友都说她太大女人主义，劝她要对男性多说赞美的话，才能得人好感。聚会结束后，离去时她们拦了一部计程车，雅惠心想不妨先来个练习，一上车便说：司机先生你好帅啊！只见那司机转过头来严肃地说：小姐，你们是不是忘了带钱？",
        @"陪室友去买耳机，老板拿出许多耳机，室友挑了半天，选了其中一个问老板：这个五十卖吗？ 老板很严肃的说：你怎么不按套路出牌，应该是我先说多少钱，然后再说看你诚实想要什么的多少钱给你。 害我练了那么久……练了那么久！！！",
        @"刚在行政服务中心遇到一同学，她惊呼：“呀，你怀孕啦，几个月啦？”\r\n“四个月。”\r\n她又说：“结婚也不知道通知一声的。”\r\n我笑笑的回应：“下次肯定叫你。”\r\n回来路上在想，她肯定是上天派来毁我的，我胖的有那么过分吗？",
        @"阿姨打完菜我马上双手合十眼鼻一线：阿弥陀佛，多谢！\r\n阿姨问：小伙子信佛了？\r\n我：不是啊，看到这斋饭我以为你们信佛！",
        @"说夏天戴墨镜和口罩可以装明星。\r\n本尊下午戴上墨镜和口罩，果然有妹子过来求合影，妹子走的时候还不吝赞美之词。\r\n“我最喜欢您的青藏高原和天路，真是太好听了。”",
        @"表弟考上大学，是建工系，打电话跟我抱怨：“班上一个女生也没有，太苦了。”\r\n我用实际工作经验告诉他：“像你这个专业，不但没有女同学，将来上班了也会没有女同事。”",
        @"今天碰到一个碰瓷老太太，硬说是我撞的，我急了，拿出手机装B说：爸，给我150万，我要撞死一老太太。\r\n那老太太一下就起来了，打了我一巴掌还说：骑自行车你还装什么富二代，于是趁机我从容的躺下了。\r\n然后我听到老太太拿起电话说：老头砸，把拖拉机开过来。。。",
        @"这天我看见一小孩来到超市，一看就是想喝饮料的，可他也没带钱，就看了半天的饮料，然后拿了一瓶，在众人惊讶的目光下喝了下去，然后把瓶盖给了售货员姐姐后就走了。我看见了瓶盖上的字，顿时惊呆了:再来一瓶。。。。。",
        @"今天我和同桌打起来了，我跟同桌说：“对不起！”\r\n同桌说应该是我先说对不起。然后我们又打起来了。。。",
        @"学着学着你就会发现：上帝为你关上了英语的窗，顺便带上了数学的门，塞上了物理的排水口，还堵死了化学的下水管道，就连语文的狗洞都给你拿水泥砌上了！！！",
        //20
        @"超市门口等人，旁边走过俩学生，一个对另一个说：“超市东西太贵了，照这消费速度，我妈都以为我吸毒了”。",
        @"对刚高中毕业的弟弟说：“大学里有那么几个女人，你经常能见到她们，她们也会慢慢认识你，偶尔会说上两句话，见面了也会微微一笑。”\r\n我弟听到这里，心里开始荡漾。\r\n我接着说：“她们就是：宿舍看门大妈，楼道清洁大妈，食堂打菜大妈，水房售卡大妈，报亭卖报大妈，机房管理大妈。”",
        @"学生时代听过一个说法：如果男女同学早恋，男生会越发充满自信，精神逐渐成熟，从而成绩节节高升；女生却会一头扎进爱河，日夜思绪万千，导致成绩一落千丈。。。\r\n现在想想，如果上述事实成立，那男生和男生谈恋爱不就皆大欢喜了么？！",
        @"上午数学考试没参加。下午下课老师让我一个人留下来补考。。。\r\n天呐我哪里会啊！看天都黑了，老师走出去端了一碗面过来。顿时我心里暖暖的。。\r\n只见老师坐在我面前一边吃面一边说：快写啊。",
        @"大四，很少去上课。今天得到通知说要检查，所以去上了节课。\r\n结果老师看见今天来了这么多人，来句：“坑爹的校领导啊，检查个鸟啊，来这么多人上课我好紧张的！”",
        @"本人高中生，今天班会，班主任黑着脸说了一句话：我知道本班有人早恋，但我不让你们叫家长，免得别班老师说我当媒婆安排俩亲家见面。。。自己看着办吧！！！",
        @"学生问老师：为什么寒暑假时间不一样长？\r\n老师：因为热胀冷缩。\r\n学生又问：为什么寒暑假作业却一样多？\r\n老师：热胀冷缩不会改变质量！",
        @"世界上最互相信任的两个人。应该是初中老师和高中老师。\r\n因为初中老师总是说：“这个知识点以后高中老师会讲的。”\r\n而高中老师则表示：“这个知识点你们初中老师应该教过。",
        @"报道称，今年不少高校分宿舍时将用相同手机的新生分在一个宿舍，即出现了苹果宿舍、三星宿舍、小米宿舍等。\r\n专家称这是目前最合理的划分宿舍标准，把相同条件和审美的人聚在一起，杜绝了宿舍内攀比的不良现象，同时日后换了手机可以调宿舍，还可激励学生的上进心。",
        @"考完英语听力，我悟出一个人生道理：有些话，只说给懂的人听。",
        //30
        @"我和暑假分手了，但我还有国庆、寒假可以共度春宵，“开学”你得到我的人，却得不到我的心。",
        @"这世上本没有脏话，数学题做多了，就有了。。。",
        @"百年校庆当天，学校西门挤满了想混进去的游客。但一位游客觉悟很高，拍了几张相片就走了。旁边的游客问他：“只跟这儿拍？”那个人说：“本来想拍校庆的，现在也还不错，拍了个西门庆。”",
        @"一个真实的笑话：魔电答疑的时候，冬梅姐姐对高爷爷说：“你说现在这些小孩儿真是的，连这个都弄不懂。”高爷爷转过脸对冬梅姐姐说：“我教你那个时候你也不懂！”【注：两人均是某校某大系教电路的老师。】",
        @"校庆期间，一个志愿者为一个老人指路，顺便开玩笑说：“老先生，您知道二教闹鬼么？”那个老人瞟了他一眼：“我都在二教为祖国工作100年了，我能不知道二教闹鬼么？”",
        @"两个带着孩子的电子系的校友碰到了一起：校友甲：哟，瞧您这孩子，长得真鲁棒！校友乙：哪里哪里，还得说是您这孩子长得有信息量。【鲁棒：Robust，也翻译为健壮；有信息量：按信息论，指小概率事件，意指长得很奇特。】",
        @"一个清华的、一个北大的、一个复旦的去圆明园。看完圆明园主题教育视频后，三个人都怒火中烧：清华的：靠，万恶的英法联军！北大的：靠，万恶的腐败清廷！复旦的：靠，万恶的售票处，多花15块的通票原来就多看这么一视频！【这里没有任何黑某校的意思，没有任何这个意思】",
        @"老师：请说出几个像马约翰这样的人物形象：学生：猫汤姆、鼠杰瑞、狗高菲……【马约翰，福建人，研究体育理论，体育教学，1914~1966年去世前一直在清华搞体育。】",
        @"甲：如果你发现有人在情人坡背面的亭子里随地大便，你会怎么处理？乙：我会走上去对他说：哟！您这坡阴亭矢量还真够大的。【坡阴亭矢量，Poynting vector，是指电磁场传播时，电磁场功率的传播方向，一般写作坡印廷矢量。这里应该是用了五个字的谐音。】",
        @"甲：听说你修了心理系双学位，来帮我解解梦呗。乙：你说你做了什么梦。甲：我梦见我穿越回了唐朝，然后被压在一块大石头底下……乙（拍了拍甲的肩膀）：没事儿，好好复习数理方程！【好像清华电子的数理方程是唐宏岩老师讲的。】",
        //40
        @"甲：不是说王力宏要来清华唱歌吗，怎么没来？乙：他去新竹那个清华唱去了。",
        @"每到一学期的boss科目考试的前一天晚上，我都会上FREE的pretest把所有旧题都搜下来，然后刷一遍。我习惯把这天晚上叫做“Free之夜”。【Pretest：电子系bbs的一个版，有往年的考试题，pre-test。】",
        @"清华已经完全做好了应对2012的准备：首先，它在2011年搞完了校庆，其次，它录取了蒋方舟来造诺亚方舟，最后，最后我只想劝大家：推研吧……",
        @"清华为了迎接奶茶mm的到来，为她所在的系建了一个图书馆，并且开始尝试在图书馆里卖奶茶。",
        @"清华歌手大赛上，有一个组合有一个计算机系的，一个电子系的，一个自动化系的。他们上场说：“大家好，我们是信乐团。”【清华信科学院，包括计算机、电子、自动化等几个系。】",
        @"毕业典礼后，一个清华学生上了出租车激动地说“你好，我已经是清华02届毕业生啦！”\r\n司机说“真巧，我是66届的”，遂一指道边卖红薯的老头儿说，“他毕业的时候还没解放呢”",
        @"一高考状元被北大录取，报到当日提出要见高晓松当年的宿舍，这可难住了北大老师。几番苦口婆心，见状元依旧执着，老师只好实言相告：‘对不起同学，高晓松是清华的……’”不想话音未落，状元厉声道：“这几年大学合并潮，北大清华没赶上么？”老师一听，撂下句“此生是教育部的官二代”便落荒而逃。",
        @"有个高考状元，他没选清华也没答应北大，他选择了新东方……问他为什么，他说：“遇到新东方厨师，你就嫁了吧！”",
        @"北大：清华，你抢走了我的高考状元，你摊上事了，你摊上大事了！清华：高考状元，快跳到碗里来！",
        @"蓝翔校长说：蓝翔学生不好好学习，那跟清华北大的还有什么区别。",
        //50
        @"刚刚开学，我在学校就看见一对新生小情侣在亲密，女的说：“我这是初吻，不给亲！”\r\n我当时上前亲了一口女的说：“现在不是初吻了，学弟，学长只能帮你到这儿了！”",
        @"高一刚进校，老师点名，喊了几声“方丈！方丈！”，没人答应。\r\n老师急了，大声喊道：“到底谁是方丈？”。\r\n这时从角落里幽幽传来一个声音：“施主，贫僧法号，方文，不是方丈！”\r\n老师。。。",
        @"英语的暑假作业里，有道题问“馒头”用英语怎么说。\r\n我写下了mantou，今天才发现，我不是最屌的，因为我同桌写的momo！",
        @"作为单身狗学长，对于学弟们，我很负责地提醒你们：首先，你们的学姐是我们的，你们不要想；其次，我们的学妹是我们的，你们不要抢；还有，从某种程度上，你们也是我们的，希望你们不要拒绝。",
        @"开学第一天，回到久违的宿舍，看见熟悉的室友们，感觉之前所有关于新学期的憧憬又都轰然dota了。",
        @"人生中有没有那么一件事，明知道失败的风险很大，有一万个理由放弃，但你还是决定孤注一掷，奋力一搏？那就是—交卷之前改答案！",
        @"天气越来越热了，我想问一下朋友圈，还有谁要结婚，还有谁孩子要生了，孩子满月，乔迁，过生日？ 需要我随礼么？如果没有，这个月我想买个半截袖。。。",
        @"要说不实用的小家电，我认为第一要属扫地机器人，我家狗狗拉了耙耙，然后扫地机器人把它抹均匀了。。。",
        @"从车站出来，门口好多出租车，就见一女孩拉个行李箱， 直直的走到一辆出租车后面，看样子，是想打开后备箱。 司机就说就一个箱子放前面吧，就见那女孩拉着箱子就去掀引擎盖了。",
        @"一个残疾人到车上乞讨，遇到一个卖保险的，在向他伸手要钱的时候，保险人员反过来向他推销起了保险。。。\r\n残疾人说保险好是好，但我没钱啊？\r\n保险员回道：没事，你再要一会儿就有了，我等你！",
        //60
        @"刚去吃面！进门看到一小朋友在吃肉丝炒面！肉丝挺多！\r\n于是我也来了一份！待我肉丝炒面上来以后肉丝少的可怜！\r\n这时听那小朋友对着老板来了句：“妈！我要喝汤。”\r\n瞬间觉得被坑了。",
        @"失恋的侄女以泪洗面，我安慰她：“叔是过来人，你要相信一次失恋没什么，以后还会遇到更好的对象。”\r\n她抽泣着回答：“你骗人！”\r\n我说：“我可是你叔，骗你干啥。”\r\n她吸了吸鼻子：“我是说你都没谈过恋爱，根本不算过来人！”",
        @"有一女同事特黑，但她妈特白，一男同事便问她：你妈是博士学位？\r\n她说：不是啊，咋这么问？\r\n男：我觉得你妈肚子里应该有很多墨水啊？",
        @"同学聚会，发现女大十八变啊，个个变仙女了。\r\n正在感慨，一女同学说：“你变化也不小啊，小时候记得你裴勇俊，大学时你郑元畅，怎么现在就郭德纲了！”",
        @"今天坐公交！我前面有个美女上车就跟开车的师傅说：“我没带钱，亲你一下就当投币了可以吗？”师傅说可以。美女亲了司机一口就坐下了。\r\n我在后面看的一清二楚，二话没说上来就一顿猛亲司机，然后说我也没带钱。\r\n司机师傅都吓哭了说，尼玛刚才那是我媳妇跟我开玩笑呢！",
        @"一姑娘去买泳衣，试了之后有点大，\r\n老板说：“没事，下水了就贴身上了。”\r\n姑娘说：“我这是去海边，万一浪大了泳衣脱落了怎么办。”\r\n老板说：“我们质量好，你怎么浪都没事！”",
    };
    KCDbManager *manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    int loop;
    for(loop = 0; loop < SUM_OF_JOKE; loop ++){
        NSString * sql = [NSString stringWithFormat:@"INSERT INTO JokeList (sentence) VALUES ('%@')",joke[loop]];
        [manager executeNonQuery:sql];
    }
    [manager close];
}
- (void) insertPictureItem{
    NSString* sentence[SUM_OF_PICTURE] = {
        @"要轻盈的像鸟，而不是羽毛。",
        @"如果可以，请直视生活中不被阳光照耀的角落、 被压迫者的痛苦和我们自己的软弱。",
        @"这世上一定还藏着很多很多只要坚持寻找，就能找到的东西。",
        @"电脑前的取暖装备和姿势，你最适合哪一种？",
        @"孤单是一种境界。",
        @"永远不要认为我们可以逃避，我们的每一步都决定着最后的结局，我们的脚正在走向我们自己选定的终点。",
        @"把我们带到过去的是回忆，将我们带向未来的是梦想。",
        @"你看到什么样的世界，你就拥有什么样的内心。",
        @"一个人路过晴天也好，穿行风雨也罢，希望你能接受，孤独才是人生常态。",
        @"我们领教了世界是何等凶顽，同时又得知世界也可以变得温存和美好。——村上春树",
        
        @"丢掉垃圾,保持好心情",
        @"雪绒花，短暂而永恒的美丽，装点着这纯真的世界。",
        @"生活中没有什么是一成不变的，我们只有一个选择：对生活充满希望，继续前进。",
        @"别人不是你的彼岸",
        @"可爱的食物",
        @"可爱的食物",
        @"永远不要拿你自己和任何人比，你是最美的。",
        @"人的成长秘密，就是去不断淘汰自己，找到完美的路。",
        @"很希望自己是一棵树，守静，向光，安然，敏感的神经末梢，触着流云和微风，窃窃的欢喜。脚下踩着最卑贱的泥，很踏实。还有，每一天都在隐秘成长。——黎戈",
        @"就算生活有一些挫折，还是要对自己微笑。",
        
        @"一万个美丽的未来，抵不上一个温暖的现在。加油！",
        @"桃红复含宿雨，柳绿更带春烟。花落家童未扫，莺啼山客犹眠。",
        @"偶尔要回头看看，否则永远都在追寻，而不知道自己失去了什么。",
        @"你能留给岁月的，岁月能留给你的，除了一个最好的自己，别无他物。",
        @"生命中，有些人即使不在你身边也能让你微笑，这样真好。",
        @"一家人就是应该一起吃饭",
        @"当你在清晨醒来，想想活着是一种多么珍贵的权利：你还能呼吸，还能思考，还能享受，还能去爱。",
        @"有时可以静下来，看看这个世界，看看晒着阳光的苔藓们，看看这一丛丛鲜活的碧绿。",
        @"我们总能在最深的绝望里，看到最美的风景。",
        @"愿你被很多人爱。如果没有，愿你在寂寞中学会宽容。",
       
        @"所有的喵星人都拥有软糯糯的爪子和软绵绵的肉垫 ，如果我肯把爪子给你，是因为我信任和喜欢你",
        @"这是你的人生，你必须为之奋斗。为你认为对的事情奋斗，为那些对于你来说重要的东西而奋斗，为你爱的人而奋斗。",
        @"有时候，你需要走出去，呼吸呼吸新鲜空气，提醒自己你是谁，你想要成为谁。",
        @"有些事，与其花时间逃避，不如早一点面对。",
        @"生活处处是快乐，只要有一颗善良细腻的心，那么一切都会是幸福的源泉",
        @"最温暖的事，莫过于陪伴。",
        @"成长会让人明白，唯一后悔的只是那些自己不曾尝试的事。",
        @"向日葵的理想，是伴随着太阳起落，用自己沉默的爱，去追求自己想要的幸福。",
        @"有一条路，每个人非走不可，那就是年轻时候的弯路。——张爱玲",
        @"假如我们把自己力所能及的事都完成了，我们会真的令自己大吃一惊。",
        
        @"知识永远是我们的小伙伴。",
        @"身是菩提树，心如明镜台。时时勤拂拭，莫使惹尘埃。",
        @"是不是坐久了感觉全身硬邦邦，有时候腰酸背痛。教大家三个动作，让大家摆脱头晕，背痛困扰。",
        @"用一杯水的单纯，面对一辈子的复杂。",
        @"每一个今日，都是你曾经幻想的明天，所以请为这个今天而努力。",
        @"活在当下，别在怀念过去或者憧憬未来中浪费掉你现在的生活。",
        @"在世如莲，净心素雅，不污不垢，淡看浮华。",
        @"随光阴流转的是岁月，随岁月流逝的是人生，而随人生流动的是风景。",
        @"出路出路，走出去才有路",
        @"吃饭，睡觉，打豆豆",
        @"在惬意的午后，一本闲书，一杯暖的茶，猫儿在玩耍",
        @"像小黄人一样开心。",
        @"做一只幸福的小黄人。",
        @"和朋友在一起最开心。",
        @"友情弥足珍贵。",
        @"我们本该满足，再多便是贪婪。",
        @"猫咪老师一天的生活",
        @"梦想这种东西啊，只有能持续最初冲动的人才能实现。",
        @"人生就如同一辆列车，我们在这趟列车上碰上形形色色的人，他们来来往往，在我们的身边来了又去，但终究会成为过客；所以，请善待身边的人。",
        @"不能僭越的是生死边界，可以融合的是心灵体温 。纵有疾风起，人生不言弃。——《起风了》",
        @"生活还是很美好的!加油呀少年！",
        @"优点和缺点的分界未必很明显，关键在于心态。",
        @"你是不是也有这样一个萌萌的好朋友~有什么不开心的可以告诉它~",
        @"勤运动，坏心情就随着汗水消失啦！",
        @"可爱妞妞阿格尼丝Agnes表情集，嘟嘟的小脸蛋很萌很治愈"
    };
    
    KCDbManager *manager = [KCDbManager new];
    [manager openDb:sqlFileName];
    int loop;
    NSString* pictureName;
    
    int type;
    for(loop = 1; loop <= SUM_OF_PICTURE; loop ++){
        if (loop == 12 || loop > 50 || loop == 31) {
            type = 2;
        }else{
            type = 1;
        }
        if (loop <= 50) {
            pictureName = [NSString stringWithFormat:@"%i.jpg",loop];
        }else{
            pictureName = [NSString stringWithFormat:@"%i.gif",loop];
        }
        NSString * sql = [NSString stringWithFormat:@"INSERT INTO PictureList (sentence, pictureName, type) VALUES ('%@','%@','%@')",sentence[loop-1],pictureName,[NSNumber numberWithInt:type]];
        [manager executeNonQuery:sql];
    }
    
    [manager close];
}
@end